[{"title":{"pt":"Usando phulp-server","en":"Using phulp-server","es":"Usando phulp-server"},"preview":{"pt":"Há um tempo atrás, por uma necessidade de projeto, criei uma ferramenta em PHP análoga ao <a href=\"http://gulpjs.com/\" target=\"_blank\">GulpJS</a>, a qual eu dei o nome de <a href=\"https://reisraff.github.io/phulp/\" target=\"_blank\">phulp</a>. As razões para a criação dessa ferramenta estão nesse post: <a href=\"https://reisraff.github.io/me/pt/post/1466448060\" target=\"_blank\">https://reisraff.github.io/me/pt/post/1466448060</a>.\n\nUltimamente, me surgiu a necessidade de ter um task \"watcher\", onde, ao atualizar uma stack de arquivos definidos, seja executado uma clousure, e pegar o resultado dessa clousure e servir em tempo real via HTTP. Ou seja, para que eu possa acompanhar o resultado final das mudanças sem ter a necessidade de fazer um build. Para isso, implementei o \"watch\" no phulp e criei o phulp-server que tem a flexibilidade de ser usado em conjunto com o phulp ou standalone.","en":"A while ago, because of a design need, I created a PHP tool analogous to <a href=\"http://gulpjs.com/\" target=\"_blank\">GulpJS</a>, which I named from <a href=\"https://reisraff.github.io/phulp/\" target=\"_blank\">phulp</a>. The reasons for creating this tool are in this post: <a href=\"https://reisraff.github.io/me/en/post/1466448060\" target=\"_blank\">https://reisraff.github.io/me/en/post/1466448060</a>.\n\nLately, I had the need to have a \"watcher\" task, where, when updating a stack of defined files, a clousure is executed, and get the result of this clousure and serve in real time via HTTP. That is, so that I can follow the final result of the changes without having to build. For that, I implemented \"watch\" in phulp and created phulp-server which has the flexibility to be used in conjunction with phulp or standalone.","es":"Hace un tiempo, debido a una necesidad de diseño, creé una herramienta PHP análoga a <a href=\"http://gulpjs.com/\" target=\"_blank\">GulpJS</a>, que denominé de <a href=\"https://reisraff.github.io/phulp/\" target=\"_blank\">phulp</a>. Las razones para crear esta herramienta se encuentran en esta publicación: <a href=\"https://reisraff.github.io/me/en/post/1466448060\" target=\"_blank\">https://reisraff.github.io/me/es/post/1466448060</a>.\n\nÚltimamente, tuve la necesidad de tener una tarea de \"observador\", donde, al actualizar una pila de archivos definidos, se ejecuta una clausura, y obtengo el resultado de esta clausura y la servimos en tiempo real a través de HTTP. Es decir, para poder seguir el resultado final de los cambios sin tener que construir. Para eso, implementé \"watch\" en phulp y creé un servidor phulp que tiene la flexibilidad de ser usado en conjunto con phulp o de forma independiente."},"postId":{"pt":"1477976403-usando-phulp-server","en":"1477976403-using-phulp-server","es":"1477976403-usando-phulp-server"},"timestamp":"1477976403"},{"title":{"pt":"Phulp","en":"Phulp","es":"Phulp"},"preview":{"pt":"Há algumas semanas me deparei com um problema e logo pensei em como solucioná-lo; Basicamente, estava utilizando o npm somente para poder instalar e utilizar o **gulpjs**. Meu projeto tinha (CSS, Js, HTML, etc.), estava utilizando o **gulpjs** somente para minificar CSS, e JS, e para compilar LESS, logo percebi que poderia salvar um pouco de recurso de maquina, e tempo de deploy fazendo tudo isso somente com o PHP, então criei o PHULP.\n\n![work-tools](post-assets/php.jpg =50%x* \"PHP\")","en":"A few weeks ago I came across a problem and soon thought of how to solve it; Basically, I was using npm just to be able to install and use **gulpjs**. My project had (CSS, Js, HTML, etc.), was using **gulpjs** only to minify CSS, and JS, and to compile LESS, so I realized that I could save a little machine resource, and time. deploy doing all this with PHP only, so I created PHULP.\n\n![work-tools](post-assets/php.jpg =50%x* \"PHP\")","es":"Hace unas semanas me encontré con un problema y pronto pensé en cómo resolverlo; Básicamente, estaba usando npm solo para poder instalar y usar **gulpjs**. Mi proyecto tenía (CSS, Js, HTML, etc.), estaba usando **gulpjs** solo para minimizar CSS y JS, y para compilar MENOS, así que me di cuenta de que podía ahorrar un pequeño recurso de máquina y tiempo. desplegué haciendo todo esto solo con PHP, así que creé PHULP.\n\n![herramientas de trabajo](post-assets/php.jpg =50%x* \"PHP\")"},"postId":{"pt":"1466448060-phulp","en":"1466448060-phulp","es":"1466448060-phulp"},"timestamp":"1466448060"},{"title":{"pt":"Automatizando tarefas com composer","en":"Automating tasks with composer","es":"Automatizar tareas con Composer"},"preview":{"pt":"Neste post não irei entrar muito a fundo em como o composer trabalha com scripts, pois a documentação do composer é muito rica nas explicações você pode ver isso <a href=\"https://getcomposer.org/doc/articles/scripts.md\" target=\"_blank\">aqui</a>. Se você leu meu <a href=\"https://reisraff.github.io/me/pt/post/1459191600\" target=\"_blank\">post anterior</a> deve imaginar que sou louco por automatização (risos).\n\nMas irei fazer uma pequena demonstração de como o composer pode facilitar sua vida automatizando tarefas como por exemplo coisas que você faz antes de um commit ou coisas do tipo.","en":"In this post I will not go deep into how the composer works with scripts, because the composer documentation is very rich in explanations you can see it <a href=\"https://getcomposer.org/doc/articles/scripts.md\" target=\"_blank\">here</a>. If you read my <a href=\"https://reisraff.github.io/me/pt/post/1459191600\" target=\"_blank\">previous post</a> you should imagine that I am crazy about automation (laughs).\n\nBut I will give you a brief demonstration of how composer can make your life easier by automating tasks such as things you do before a commit or things like that.","es":"En esta publicación no profundizaré en cómo funciona el compositor con scripts, porque la documentación del compositor es muy rica en explicaciones, puede ver esto <a href=\"https://getcomposer.org/doc/articles/scripts.md\" target=\" _ blank\">aquí</a>. Si lees mi <a href=\"https://reisraff.github.io/me/en/post/1459191600\" target=\"_blank\">publicación anterior</a> debes imaginar que estoy loco por la automatización (risas).\n\nPero te daré una breve demostración de cómo el compositor puede hacerte la vida más fácil al automatizar tareas como las cosas que haces antes de un commit o cosas así."},"postId":{"pt":"1461870480-automatizando-tarefas-com-composer","en":"1461870480-automating-tasks-with-composer","es":"1461870480-automatizar-tareas-con-composer"},"timestamp":"1461870480"},{"title":{"pt":"Automatizando Tarefas com PHING","en":"Automating tasks with PHING","es":"Automatizar tareas con PHING"},"preview":{"pt":"Nessa última semana que se passou eu fui no <a href=\"http://phpexperience2016.imasters.com.br\" target=\"_blank\">PHP Experience</a> oferecido pela <a href=\"http://imasters.com.br/\" target=\"_blank\">iMasters</a>, e em uma das palestras que assisti, ouvi sobre automatização, é uma coisa comum na àrea da Informática, principalmente pelos programadores, na verdade se for parar para pensar, o trabalho de um programador nada mais é do que automatizar processos, e nada mais justo que ter uma ferramenta que ajude os programadores a fazer esse trabalho, automatizando testes, builds, etc.\n\nNessa palestra que assisti, o <a href=\"https://twitter.com/hussanii\" target=\"_blank\">Hussani Oliveira</a> falou um pouco sobre isso, algumas técnicas que muitas pessoas nessa área e até ele mesmo utiliza, e também falou sobre o <a href=\"https://www.phing.info/\" target=\"_blank\">PHING</a> uma ferramenta de automatização escrita em <a href=\"http://php.net/\" target=\"_blank\">PHP</a> baseada no <a href=\"http://ant.apache.org/\" target=\"_blank\">Apache Ant</a>, eu já tinha ouvido falar dessa ferramenta antes da palestra, porém nunca tinha usado, e resolvi usar, e por achar muito boa essa ferramenta eu resolvi escrever sobre ela.","en":"This past week I went to <a href=\"http://phpexperience2016.imasters.com.br\" target=\"_blank\">PHP Experience</a> offered by  <a href=\"http://imasters.com.br/\" target=\"_blank\">iMasters</a>, and in one of the lectures I attended, I heard about automation, it's a common thing in the area of Informatics, especially by programmers, actually if you stop to think, work Being a programmer is nothing more than automating processes, and it's only fair to have a tool that helps programmers do this work by automating tests, builds, etc.\n\nIn this lecture I attended, <a href=\"https://twitter.com/hussanii\" target=\"_blank\">Hussani Oliveira</a> talked a little bit about it, some techniques that many people in this area and even uses it, and also talked about <a href=\"https://www.phing.info/\" target=\"_blank\">PHING</a> an automation tool written in <a href=\"http://php.net/\" target=\"_blank\">PHP</a> based on <a href=\"http://ant.apache.org/\" target=\"_blank\">Apache Ant</a>, I had heard of this tool before the lecture, but I had never used it, and I decided to use it, and because I found this tool very good I decided to write about it.","es":"La semana pasada fui a <a href=\"http://phpexperience2016.imasters.com.br\" target=\"_blank\">PHP Experience</a> ofrecido por <a href = \"http: // imasters .com / \"target =\" _ blank \">iMasters</a>, y en una de las conferencias a las que asistí, escuché sobre la automatización, es algo común en el área de la informática, especialmente para los programadores, de hecho, si dejas de pensar , el trabajo de un programador no es más que automatizar procesos, y es justo tener una herramienta que ayude a los programadores a hacer ese trabajo mediante la automatización de pruebas, compilaciones, etc.\n\nEn esta conferencia a la que asistí, <a href=\"https://twitter.com/hussanii\" target=\"_blank\">Hussani Oliveira</a> habló un poco sobre esto, algunas técnicas que muchas personas en esta área e incluso él mismo utiliza, y también habló sobre <a href=\"https://www.phing.info/\" target=\"_blank\">PHING</a>, una herramienta de automatización escrita en <a href = \"http: // php .net / \"target =\" _ blank \">PHP</a> basado en <a href=\"http://ant.apache.org/\" target=\"_blank\">Apache Ant</a>, ya había escuchado hablé sobre esta herramienta antes de la conferencia, pero nunca la había usado, y decidí usarla, y como encontré esta herramienta muy buena, decidí escribir sobre ella."},"postId":{"pt":"1459191600-automatizando-tarefas-com-phing","en":"1459191600-automating-tasks-with-phing","es":"1459191600-automatizar-tareas-con-phing"},"timestamp":"1459191600"},{"title":{"pt":"Ferramentas de trabalho","en":"Working tools","es":"Herramientas de trabajo"},"preview":{"pt":"Esse tema muitas vezes acaba virando uma discução legal no trabalho, pois muitos usam as mesmas ferramentas que você, já outros preferem outras ferramentas e à partir disso começamos a melhorar nossas tecnicas de argumentos, as vezes testamos a ferramenta que colega indicou, as vezes acabamos trocando a nossa ferramenta pela dele, em fim.\n\n![work-tools](post-assets/work-tools.jpg =100%x* \"Work Tool\")","en":"This theme often turns out to be a nice discussion at work, because many use the same tools as you, others prefer other tools and from there we start to improve our argument techniques, sometimes we test the tool that colleague indicated, sometimes we end up exchanging our tool for his in the end.\n\n![work-tools](post-assets/work-tools.jpg =100%x* \"Work Tool\")","es":"Este tema a menudo resulta ser una buena discusión en el trabajo, porque muchos usan las mismas herramientas que usted, otros prefieren otras herramientas y a partir de ahí comenzamos a mejorar nuestras técnicas de argumento, a veces probamos la herramienta que el colega indicó, a veces terminamos intercambiando nuestra herramienta por la suya al final.\n\n![herramientas de trabajo](post-assets/work-tools.jpg =100%x* \"Herramienta de trabajo\")"},"postId":{"pt":"1458320400-ferramentas-de-trabalho","en":"1458320400-working-tools","es":"1458320400-herramientas-de-trabajo"},"timestamp":"1458320400"}]