[{"title":{"pt":"Ferramentas de trabalho","en":"Working tools","es":"Herramientas de trabajo"},"preview":{"pt":"Esse tema muitas vezes acaba virando uma discução legal no trabalho, pois muitos usam as mesmas ferramentas que você, já outros preferem outras ferramentas e à partir disso começamos a melhorar nossas tecnicas de argumentos, as vezes testamos a ferramenta que colega indicou, as vezes acabamos trocando a nossa ferramenta pela dele, em fim.\n\n![work-tools](post-assets/work-tools.jpg =100%x* \"Work Tool\")","en":"This theme often turns out to be a nice discussion at work, because many use the same tools as you, others prefer other tools and from there we start to improve our argument techniques, sometimes we test the tool that colleague indicated, sometimes we end up exchanging our tool for his in the end.\n\n![work-tools](post-assets/work-tools.jpg =100%x* \"Work Tool\")","es":"Este tema a menudo resulta ser una buena discusión en el trabajo, porque muchos usan las mismas herramientas que usted, otros prefieren otras herramientas y a partir de ahí comenzamos a mejorar nuestras técnicas de argumento, a veces probamos la herramienta que el colega indicó, a veces terminamos intercambiando nuestra herramienta por la suya al final.\n\n![herramientas de trabajo](post-assets/work-tools.jpg =100%x* \"Herramienta de trabajo\")"},"postId":{"pt":"1458320400-ferramentas-de-trabalho","en":"1458320400-working-tools","es":"1458320400-herramientas-de-trabajo"},"timestamp":"1458320400"},{"title":{"pt":"1st Post - O que falar?! o.O","en":"1st Post - What to say?! o.O","es":"1st Post - ¿Qué decir? o.O"},"preview":{"pt":"Boa madrugada! Pois é aqui agora são 2 da manhã, e eu estou pensando o que vou escrever no próximo parágrafo.\n\nEnfim, já tinha passado da hora! Tinha que começar a escrever e colocar um pouco das coisas das minha cabeça para o mundo ver.","en":"Good dawn! 'cause now it's 2a.m, and I am thinking what to write in the next paragraph.\n\nWell, it is now time! I had to start to write and put some of my stuff available to the worldwide.","es":"Buenos dias Bueno, aquí son las 2 de la mañana, y estoy pensando en lo que escribiré en el próximo párrafo.\n\nDe todos modos, ya era hora! Tuve que comenzar a escribir y poner algunas de las cosas en mi cabeza para que el mundo las viera."},"postId":{"pt":"1458244800-1st-post-o-que-falar-oo","en":"1458244800-1st-post-what-to-say-oo","es":"1458244800-1st-post-que-decir-oo"},"timestamp":"1458244800"}]