[{"title":{"pt":"port-65144 write-up (Buffer Overflow)","en":"port-65144 write-up (Buffer Overflow)","es":"port-65144 write-up (Buffer Overflow)"},"preview":{"pt":"Farei este artigo mais como uma aula de buffer overflow, uma vez que existem variras manhas. Espero que goste da leitura e que possa ser útil para você.\n\n## Introdução","en":"I will make this write-up more like a class of buffer overflow since it has a lot of tricks. So I hope you enjoy the read, and hopefully it could be useful for you.\n\n## Intro","es":"Haré este articulo mas como una classe de buffer overflow, una vez que exiten varios trucos. Ojala que les gusten la lectura y que les sirvan para algo.\n\n## Introdución"},"postId":{"pt":"1598882734-port-65144-write-up-buffer-overflow","en":"1598882734-port-65144-write-up-buffer-overflow","es":"1598882734-port-65144-write-up-buffer-overflow"},"timestamp":"1598882734"},{"title":{"pt":"Eu preciso de tempo?","en":"Do I need time?","es":"Necesito de tiempo?"},"preview":{"pt":"Acho que não!\n\n### TLDR; (muito longo não leia)","en":"I don't think so!\n\n### TLDR; (Too long don't read)","es":"No creo!\n\n### TLDR; (muy largo no leas)"},"postId":{"pt":"1588282983-eu-preciso-de-tempo","en":"1588282983-do-i-need-time","es":"1588282983-necesito-de-tiempo"},"timestamp":"1588282983"},{"title":{"pt":"Hacking","en":"Hacking","es":"Hacking"},"preview":{"pt":"Nos últimos anos estive estudando coisas diferentes e me deu vontade de uma hora pra outra de querer entender como as coisas funcionavam por baixo dos panos.\n\nComecei como sempre: aplicando a técnica de estudos que uso, sendo elas uma lista bem simples, e que... Bom, tem funcionado comigo até então.","en":"In the last past years I've been studying different stuff and I felt like I was wanting to understand how those things works in low level.\n\nI started as always: applying a study technique that I am used to use, a simple list, and... well, It has worked with me since I know me as human.","es":"En los ultimos años estube estudiando cosas diferentes y me dio ganas de quere entender como las cosas funcionam por mas abajo.\n\nYo empezé como siempre: aplicando la técnica de estudios que uso, siendo ella una lista sencilla, y que... bueno, siempre funcionó conmigo hasta ahora."},"postId":{"pt":"1571686385-hacking","en":"1571686385-hacking","es":"1571686385-hacking"},"timestamp":"1571686385"},{"title":{"pt":"Usando phulp-server","en":"Using phulp-server","es":"Usando phulp-server"},"preview":{"pt":"Há um tempo atrás, por uma necessidade de projeto, criei uma ferramenta em PHP análoga ao <a href=\"http://gulpjs.com/\" target=\"_blank\">GulpJS</a>, a qual eu dei o nome de <a href=\"https://reisraff.github.io/phulp/\" target=\"_blank\">phulp</a>. As razões para a criação dessa ferramenta estão nesse post: <a href=\"https://reisraff.github.io/me/pt/post/1466448060\" target=\"_blank\">https://reisraff.github.io/me/pt/post/1466448060</a>.\n\nUltimamente, me surgiu a necessidade de ter um task \"watcher\", onde, ao atualizar uma stack de arquivos definidos, seja executado uma clousure, e pegar o resultado dessa clousure e servir em tempo real via HTTP. Ou seja, para que eu possa acompanhar o resultado final das mudanças sem ter a necessidade de fazer um build. Para isso, implementei o \"watch\" no phulp e criei o phulp-server que tem a flexibilidade de ser usado em conjunto com o phulp ou standalone.","en":"A while ago, because of a design need, I created a PHP tool analogous to <a href=\"http://gulpjs.com/\" target=\"_blank\">GulpJS</a>, which I named from <a href=\"https://reisraff.github.io/phulp/\" target=\"_blank\">phulp</a>. The reasons for creating this tool are in this post: <a href=\"https://reisraff.github.io/me/en/post/1466448060\" target=\"_blank\">https://reisraff.github.io/me/en/post/1466448060</a>.\n\nLately, I had the need to have a \"watcher\" task, where, when updating a stack of defined files, a clousure is executed, and get the result of this clousure and serve in real time via HTTP. That is, so that I can follow the final result of the changes without having to build. For that, I implemented \"watch\" in phulp and created phulp-server which has the flexibility to be used in conjunction with phulp or standalone.","es":"Hace un tiempo, debido a una necesidad de diseño, creé una herramienta PHP análoga a <a href=\"http://gulpjs.com/\" target=\"_blank\">GulpJS</a>, que denominé de <a href=\"https://reisraff.github.io/phulp/\" target=\"_blank\">phulp</a>. Las razones para crear esta herramienta se encuentran en esta publicación: <a href=\"https://reisraff.github.io/me/en/post/1466448060\" target=\"_blank\">https://reisraff.github.io/me/es/post/1466448060</a>.\n\nÚltimamente, tuve la necesidad de tener una tarea de \"observador\", donde, al actualizar una pila de archivos definidos, se ejecuta una clausura, y obtengo el resultado de esta clausura y la servimos en tiempo real a través de HTTP. Es decir, para poder seguir el resultado final de los cambios sin tener que construir. Para eso, implementé \"watch\" en phulp y creé un servidor phulp que tiene la flexibilidad de ser usado en conjunto con phulp o de forma independiente."},"postId":{"pt":"1477976403-usando-phulp-server","en":"1477976403-using-phulp-server","es":"1477976403-usando-phulp-server"},"timestamp":"1477976403"},{"title":{"pt":"Phulp","en":"Phulp","es":"Phulp"},"preview":{"pt":"Há algumas semanas me deparei com um problema e logo pensei em como solucioná-lo; Basicamente, estava utilizando o npm somente para poder instalar e utilizar o **gulpjs**. Meu projeto tinha (CSS, Js, HTML, etc.), estava utilizando o **gulpjs** somente para minificar CSS, e JS, e para compilar LESS, logo percebi que poderia salvar um pouco de recurso de maquina, e tempo de deploy fazendo tudo isso somente com o PHP, então criei o <a href=\"https://reisraff.github.io/phulp/\" target=\"_blank\">PHULP</a>.\n\n![work-tools](post-assets/php.jpg =50%x* \"PHP\")","en":"A few weeks ago I came across a problem and soon thought of how to solve it; Basically, I was using npm just to be able to install and use **gulpjs**. My project had (CSS, Js, HTML, etc.), was using **gulpjs** only to minify CSS, and JS, and to compile LESS, so I realized that I could save a little machine resource, and time. deploy doing all this with PHP only, so I created <a href=\"https://reisraff.github.io/phulp/\" target=\"_blank\">PHULP</a>.\n\n![work-tools](post-assets/php.jpg =50%x* \"PHP\")","es":"Hace unas semanas me encontré con un problema y pronto pensé en cómo resolverlo; Básicamente, estaba usando npm solo para poder instalar y usar **gulpjs**. Mi proyecto tenía (CSS, Js, HTML, etc.), estaba usando **gulpjs** solo para minimizar CSS y JS, y para compilar MENOS, así que me di cuenta de que podía ahorrar un pequeño recurso de máquina y tiempo. desplegué haciendo todo esto solo con PHP, así que creé <a href=\"https://reisraff.github.io/phulp/\" target=\"_blank\">PHULP</a>.\n\n![herramientas de trabajo](post-assets/php.jpg =50%x* \"PHP\")"},"postId":{"pt":"1466448060-phulp","en":"1466448060-phulp","es":"1466448060-phulp"},"timestamp":"1466448060"}]