[{"title":{"pt":"Usando phulp-server"},"preview":{"pt":"Há um tempo atrás, por uma necessidade de projeto, criei uma ferramenta em PHP análoga ao <a href=\"http://gulpjs.com/\" target=\"_blank\">GulpJS</a>, a qual eu dei o nome de <a href=\"https://reisraff.github.io/phulp/\" target=\"_blank\">phulp</a>. As razões para a criação dessa ferramenta estão nesse post: <a href=\"https://reisraff.github.io/#!/posts/1/5\" target=\"_blank\">https://reisraff.github.io/#!/posts/1/5</a>.\n\nUltimamente, me surgiu a necessidade de ter um task \"watcher\", onde, ao atualizar uma stack de arquivos definidos, seja executado uma clousure, e pegar o resultado dessa clousure e servir em tempo real via HTTP. Ou seja, para que eu possa acompanhar o resultado final das mudanças sem ter a necessidade de fazer um build. Para isso, implementei o \"watch\" no phulp e criei o phulp-server que tem a flexibilidade de ser usado em conjunto com o phulp ou standalone."},"timestamp":"1477976403"},{"title":{"pt":"Phulp"},"preview":{"pt":"<a href=\"https://reisraff.github.io/phulp/dist/#!/home\" target=\"_blank\">https://reisraff.github.io/phulp/dist/#!/home</a>\n\nHá algumas semanas me deparei com um problema e logo pensei em como solucioná-lo; Basicamente, estava utilizando o npm somente para poder instalar e utilizar o **gulpjs**. Meu projeto tinha (CSS, Js, HTML, etc.), estava utilizando o **gulpjs** somente para minificar CSS, e JS, e para compilar LESS, logo percebi que poderia salvar um pouco de recurso de maquina, e tempo de deploy fazendo tudo isso somente com o PHP, então criei o PHULP."},"timestamp":"1466448060"},{"title":{"pt":"Automatizando tarefas com composer"},"preview":{"pt":"Neste post não irei entrar muito a fundo em como o composer trabalha com scripts, pois a documentação do composer é muito rica nas explicações você pode ver isso <a href=\"https://getcomposer.org/doc/articles/scripts.md\" target=\"_blank\">aqui</a>. Se você leu meu <a href=\"https://reisraff.github.io/dist/#!/posts/1/3\" target=\"_blank\">post anterior</a> deve imaginar que sou louco por automatização (risos).\n\nMas irei fazer uma pequena demonstração de como o composer pode facilitar sua vida automatizando tarefas como por exemplo coisas que você faz antes de um commit ou coisas do tipo."},"timestamp":"1461870480"},{"title":{"pt":"Automatizando Tarefas com PHING"},"preview":{"pt":"Nessa última semana que se passou eu fui no <a href=\"http://phpexperience2016.imasters.com.br\" target=\"_blank\">PHP Experience</a> oferecido pela <a href=\"http://imasters.com.br/\" target=\"_blank\">iMasters</a>, e em uma das palestras que assisti, ouvi sobre automatização, é uma coisa comum na àrea da Informática, principalmente pelos programadores, na verdade se for parar para pensar, o trabalho de um programador nada mais é do que automatizar processos, e nada mais justo que ter uma ferramenta que ajude os programadores a fazer esse trabalho, automatizando testes, builds, etc.\n\nNessa palestra que assisti, o <a href=\"https://twitter.com/hussanii\" target=\"_blank\">Hussani Oliveira</a> falou um pouco sobre isso, algumas técnicas que muitas pessoas nessa área e até ele mesmo utiliza, e também falou sobre o <a href=\"https://www.phing.info/\" target=\"_blank\">PHING</a> uma ferramenta de automatização escrita em <a href=\"http://php.net/\" target=\"_blank\">PHP</a> baseada no <a href=\"http://ant.apache.org/\" target=\"_blank\">Apache Ant</a>, eu já tinha ouvido falar dessa ferramenta antes da palestra, porém nunca tinha usado, e resolvi usar, e por achar muito boa essa ferramenta eu resolvi escrever sobre ela."},"timestamp":"1459191600"},{"title":{"pt":"Ferramentas de trabalho"},"preview":{"pt":"Esse tema muitas vezes acaba virando uma discução legal no trabalho, pois muitos usam as mesmas ferramentas que você, já outros preferem outras ferramentas e à partir disso começamos a melhorar nossas tecnicas de argumentos, as vezes testamos a ferramenta que colega indicou, as vezes acabamos trocando a nossa ferramenta pela dele, em fim.\n\n![work-tools](assets/posts/post-assets/2/work-tools.jpg =100%x* \"Work Tool\")"},"timestamp":"1458320400"}]